Reports/Э_СтатистикаПоЛидам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>Э_СтатистикаПоЛидам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УниверсальныйОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.УниверсальныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Documents/Событие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>Событие</Name>
			<Comment>(Упр)</Comment>
			<BasedOn>
				<xr:Item>Document.Событие</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ВозвратТоваровОтПокупателя</xr:Item>
				<xr:Item>Document.ВозвратТоваровПоставщику</xr:Item>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
				<xr:Item>Document.ОтчетКомиссионераОПродажах</xr:Item>
				<xr:Item>Document.ОтчетКомитентуОПродажах</xr:Item>
				<xr:Item>Document.ПереоценкаТоваровОтданныхНаКомиссию</xr:Item>
				<xr:Item>Document.ПереоценкаТоваровПринятыхНаКомиссию</xr:Item>
				<xr:Item>Document.РезервированиеТоваров</xr:Item>
				<xr:Item>Document.ПриходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.РасходныйКассовыйОрдер</xr:Item>
				<xr:Item>Document.ПлатежноеПоручениеВходящее</xr:Item>
				<xr:Item>Document.ПлатежноеПоручениеИсходящее</xr:Item>
				<xr:Item>Document.СчетНаОплатуПоставщика</xr:Item>
				<xr:Item>Document.СчетНаОплатуПокупателю</xr:Item>
				<xr:Item>Document.ВозвратТоваровПоставщикуИзНТТ</xr:Item>
				<xr:Item>Document.ПоступлениеТоваровУслугВНТТ</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсточникИнформацииПриОбращении</xr:Item>
				<xr:Item>InformationRegister.ПланируемаяЗанятостьПомещений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовСобытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Э_Лид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Э_Лиды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформацииПриОбращении</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииПриОбращенииПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьНапомнитьОСобытии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмо</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.РезервированиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереоценкаТоваровПринятыхНаКомиссию</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереоценкаТоваровОтданныхНаКомиссию</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВходящееИсходящееСобытие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Территория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Территории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВложения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоБезКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИнтервалНапоминания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметКонтакта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Важность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Трудозатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Э_CallIDЗвонкаBinotel</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Э_ПропущенныйЗвонок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Э_ТелефонАбонента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Э_SMSСообщение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Э_НашНомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СторонниеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Лицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Э_Лиды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Э_Лиды</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IP_Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMAIL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветсвенныйМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Э_СтатусыЛидов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьЭ_ДатаПоследнегоЗапланированногоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Э_ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Э_Регистратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удалить_Э_CustomerID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Э_ДатаПереходаВКлиента</Name>
					<Comment>Э_Волощук (21.12.2016)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Э_ВыгружатьВБДВиртуальнойАТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Э_ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииПриОбращенииПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/Э_СтатистикаПоЛидам/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	УниверсальныйОтчет.ИмяРегистра = "";
	УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	Э_Лиды.Ссылка КАК Лид,
		               |	Э_Лиды.Родитель КАК ГруппаЛида,
		               |	Э_Лиды.ОтветсвенныйМенеджер КАК Пользователь,
		               |	Э_Лиды.Э_ДатаРегистрации КАК ДатаРегистрации,
		               |	Э_Лиды.Контрагент,
		               |	Э_Лиды.КонтактноеЛицо,
		               |	Э_Лиды.НомерТелефона,
		               |	Э_Лиды.Адрес,
		               |	Э_Лиды.EMAIL,
		               |	ВЫРАЗИТЬ(Э_Лиды.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
		               |	Э_Лиды.Закрыт,
		               |	0 КАК КоличествоЛидов,
		               |	ВЫБОР
		               |		КОГДА Э_Лиды.Э_ДатаРегистрации > &ДатаНачала
		               |				И Э_Лиды.Э_ДатаРегистрации < &ДатаКонца
		               |			ТОГДА 1
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК Новые,
		               |	ВЫБОР
		               |		КОГДА Э_Лиды.Э_ДатаПереходаВКлиента <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		               |			ТОГДА 1
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК ПерешлиВКлиентов,
		               |	СобытияПоЛиду.КоличествоСобытий КАК КоличествоСобытий
		               |{ВЫБРАТЬ
		               |	Лид.*,
		               |	ГруппаЛида.*,
		               |	Пользователь.*,
		               |	ДатаРегистрации,
		               |	Контрагент.*,
		               |	КонтактноеЛицо.*,
		               |	НомерТелефона,
		               |	Адрес,
		               |	EMAIL,
		               |	Комментарий,
		               |	Закрыт,
		               |	КоличествоЛидов КАК КоличествоЛидов,
		               |	(ВЫБОР
		               |			КОГДА Э_Лиды.Э_ДатаРегистрации > &ДатаНачала
		               |					И Э_Лиды.Э_ДатаРегистрации < &ДатаКонца
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Новые,
		               |	(ВЫБОР
		               |			КОГДА Э_Лиды.Э_ДатаПереходаВКлиента <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК ПерешлиВКлиентов,
		               |	СобытияПоЛиду.КоличествоСобытий КАК КоличествоСобытий}
		               |ИЗ
		               |	Справочник.Э_Лиды КАК Э_Лиды
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			Событие.Э_Лид КАК Э_Лид,
		               |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Событие.Ссылка) КАК КоличествоСобытий
		               |		ИЗ
		               |			Документ.Событие КАК Событие
		               |		ГДЕ
		               |			НЕ Событие.ПометкаУдаления
		               |		
		               |		СГРУППИРОВАТЬ ПО
		               |			Событие.Э_Лид) КАК СобытияПоЛиду
		               |		ПО (СобытияПоЛиду.Э_Лид = Э_Лиды.Ссылка)
		               |ГДЕ
		               |	Э_Лиды.ЭтоГруппа = ЛОЖЬ
		               |	И Э_Лиды.Э_ДатаРегистрации МЕЖДУ &ДатаНачала И &ДатаКонца
		               |{ГДЕ
		               |	СобытияПоЛиду.КоличествоСобытий,
		               |	Э_Лиды.Родитель.* КАК ГруппаЛида,
		               |	Э_Лиды.ОтветсвенныйМенеджер.* КАК Пользователь,
		               |	Э_Лиды.Контрагент.*,
		               |	Э_Лиды.КонтактноеЛицо.*,
		               |	Э_Лиды.Закрыт,
		               |	Э_Лиды.Ссылка.* КАК Лид,
		               |	Э_Лиды.НомерТелефона,
		               |	Э_Лиды.Адрес,
		               |	Э_Лиды.EMAIL,
		               |	(ВЫРАЗИТЬ(Э_Лиды.Комментарий КАК СТРОКА(1000))) КАК Комментарий}
		               |{УПОРЯДОЧИТЬ ПО
		               |	Пользователь.*,
		               |	ГруппаЛида.*,
		               |	Лид.*}
		               |ИТОГИ
		               |	КОЛИЧЕСТВО(КоличествоЛидов),
		               |	СУММА(Новые),
		               |	СУММА(ПерешлиВКлиентов)
		               |ПО
		               |	ОБЩИЕ
		               |{ИТОГИ ПО
		               |	Пользователь.*,
		               |	ГруппаЛида.*,
		               |	Лид.*,
		               |	ДатаРегистрации,
		               |	Контрагент.*,
		               |	КонтактноеЛицо.*}
		               |АВТОУПОРЯДОЧИВАНИЕ";
	
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "Лид",         		"Лид");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ГруппаЛида",         "Группа лидов");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "Пользователь",   	"Пользователь");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ДатаРегистрации",    "Дата регистрации");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "Контрагент",    		"Контрагент");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "КонтактноеЛицо",    	"Контактное лицо");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "НомерТелефона",      "Номер телефона");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "Адрес",      		"Адрес");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "EMAIL",      		"E-MAIL");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "Комментарий",      	"Комментарий");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "Закрыт",      		"Закрыт");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "КоличествоЛидов",	"Количество лидов");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "Новые",				"Новые");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "ПерешлиВКлиентов",	"Перешли в клиентов");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить( "КоличествоСобытий",	"Количество событий по лиду");
		
	УниверсальныйОтчет.ДобавитьПоказатель("КоличествоЛидов", "Количество лидов", Истина, "ЧЦ=15; ЧДЦ=; ЧН=' '");

	УниверсальныйОтчет.ДобавитьПоказатель("Новые", "Новые", Истина, "ЧЦ=15; ЧДЦ=; ЧН=' '");
	УниверсальныйОтчет.ДобавитьПоказатель("ПерешлиВКлиентов", "Перешли в клиентов", Истина, "ЧЦ=15; ЧДЦ=; ЧН=' '");
	
	
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Пользователь");
	УниверсальныйОтчет.ДобавитьИзмерениеСтроки("ГруппаЛида");
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("Лид", ТипРазмещенияРеквизитовИзмерений.Отдельно,3);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("НомерТелефона", ТипРазмещенияРеквизитовИзмерений.Отдельно,3);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("Контрагент", ТипРазмещенияРеквизитовИзмерений.Отдельно,3);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("КонтактноеЛицо", ТипРазмещенияРеквизитовИзмерений.Отдельно,3);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("Адрес", ТипРазмещенияРеквизитовИзмерений.Отдельно,3);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("EMAIL", ТипРазмещенияРеквизитовИзмерений.Отдельно,3);
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("Комментарий", ТипРазмещенияРеквизитовИзмерений.Отдельно,3);
 		
	УниверсальныйОтчет.ДобавитьДополнительноеПоле("КоличествоСобытий",	ТипРазмещенияРеквизитовИзмерений.Отдельно,3);
	
	УниверсальныйОтчет.ДобавитьПорядок("Пользователь");
		
КонецПроцедуры 

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ДатаНачала", УниверсальныйОтчет.ДатаНач);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ДатаКонца", УниверсальныйОтчет.ДатаКон);
		
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);
	ТабличныйДокумент.ФиксацияСлева = 2;
КонецПроцедуры 

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	ДополнительныеПараметры = Неопределено;
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры 

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	
КонецПроцедуры 

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции 

УниверсальныйОтчет.мРежимВводаПериода = 0;


#КонецЕсли
